In [ ]:
# pip3 install pandas numpy scikit-learn matplotlib seaborn torch

In [1]:
import pandas as pd
import os
import numpy as np 

import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv("data/train.csv")

In [3]:
data.head()

   id  annual_income  ...  grade_subgrade  loan_paid_back
0   0       29367.99  ...              C3             1.0
1   1       22108.02  ...              D3             0.0
2   2       49566.20  ...              C5             1.0
3   3       46858.25  ...              F1             1.0
4   4       25496.70  ...              D1             1.0

[5 rows x 13 columns]

In [4]:
data.describe()

                  id  annual_income  ...  interest_rate  loan_paid_back
count  593994.000000  593994.000000  ...  593994.000000   593994.000000
mean   296996.500000   48212.202976  ...      12.356345        0.798820
std    171471.442236   26711.942078  ...       2.008959        0.400883
min         0.000000    6002.430000  ...       3.200000        0.000000
25%    148498.250000   27934.400000  ...      10.990000        1.000000
50%    296996.500000   46557.680000  ...      12.370000        1.000000
75%    445494.750000   60981.320000  ...      13.680000        1.000000
max    593993.000000  393381.740000  ...      20.990000        1.000000

[8 rows x 7 columns]

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 593994 entries, 0 to 593993
Data columns (total 13 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   id                    593994 non-null  int64
 1   annual_income         593994 non-null  float64
 2   debt_to_income_ratio  593994 non-null  float64
 3   credit_score          593994 non-null  int64
 4   loan_amount           593994 non-null  float64
 5   interest_rate         593994 non-null  float64
 6   gender                593994 non-null  object
 7   marital_status        593994 non-null  object
 8   education_level       593994 non-null  object
 9   employment_status     593994 non-null  object
 10  loan_purpose          593994 non-null  object
 11  grade_subgrade        593994 non-null  object
 12  loan_paid_back        593994 non-null  float64
dtypes: float64(5), int64(2), object(6)
memory usage: 58.9+ MB

In [6]:
data.shape

(593994, 13)